In [ ]:
import pandas as pd

df = pd.read_excel("../data/raww_hr_analytics_data.xlsx")

In [3]:
df.head()

,employee_id,full_name,department,position,location,hire_date,termination_date,termination_reason,salary,age,gender,is_active
0,EMP0001,Nhân viên 1,HR,Manager,Đà Nẵng,2023-11-24,NaT,NaN,45054301,36,Nam,True
1,EMP0002,Nhân viên 2,Operations,Director,Hà Nội,2023-12-13,2024-05-02,Sa thải,82953410,49,Nam,False
2,EMP0003,Nhân viên 3,Finance,Manager,TP.HCM,2023-09-16,NaT,NaN,49006407,56,Nữ,True
3,EMP0004,Nhân viên 4,Sales,Manager,TP.HCM,2023-10-29,NaT,NaN,48856417,49,Nữ,True
4,EMP0005,Nhân viên 5,Customer Service,Junior,Hà Nội,2023-04-21,NaT,NaN,13778008,46,Nam,True